app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-07-25 13:00:15.905995"], ["updated_at", "2018-07-25 13:00:15.905995"]]
---
	def create
	  @school_class = SchoolClass.new
	  @school_class.title = params[:title]
	  @school_class.room_number = params[:room_number]
	  @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-07-25 12:52:04.603190"], ["id", 1]]
---
	def update
	  @school_class = SchoolClass.find(params[:id])
		@school_class.update(params.require(:school_class))