app/controllers/students_controller.rb

	def create
	  @student = Student.new
	  @student.first_name = params[:first_name]
	  @student.last_name = params[:last_name]
	  @student.save
---
INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-07-25 12:56:05.281149"], ["updated_at", "2018-07-25 12:56:05.281149"]]

	def update
	  @student = Student.find(params[:id])
		@student.update(params.require(:student))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-25 12:55:20.306444"], ["id", 1]]